Hello,
I am encountering another issue in the second part of the Pool Allocation
phase. I have performed a fresh, full deployment of the application, and my
OpenStack cloud environment appears to be functioning correctly.

For context, I am using a private DNS configuration, although I do not
believe this is the source of the problem.

The deployment was carried out using the following options:
***@***.***:~/cuartoDeploy/devops-tf-deployment/tf-head-services$ cat
tfvars/deployment.tfvars
acme_contact                  = ***@***.***"
application_credential_id     = "f47a02ed(...)6efe24"
application_credential_secret = "QGeZW(...)kHxIjlFP3g"
enable_monitoring             = false
gen_user_count                = "100"
head_host                     = "10.0.1.137"
v
kubernetes_api_url            = "https://10.0.1.137:6443"
head_version                  = "2.0.0"
gen_users_version             = "1.0.0"
postgres_version              = "2.0.0"
certs_version                 = "1.0.1"
man_image                     = "ubuntu-noble-x86_64"
os_auth_url                   = "http://10.0.1.112:5000/v3/"
openid_configuration_insecure = true
users = {
  # Example of a user from local Keycloack issuer
    "crczp-admin" = {
      iss              = "https://10.0.1.137/keycloak/realms/CRCZP"
      keycloakUsername = "crczp-admin"
      keycloakPassword = "(...)"
      email       = ***@***.***"
      fullName         = "Demo Admin"
      givenName        = "Demo"
      familyName       = "Admin"
      admin            = true
    }
}
I would appreciate any help fixing the problem.

El vie, 13 feb 2026 a las 13:50, Tomas Sapak ***@***.***>)
escribió:

> *sapak-cshub* left a comment (cyberrangecz/issues#11)
> <https://github.com/cyberrangecz/issues/issues/11#issuecomment-3897067093>
>
> CyberRange is not able to connect sandbox management node:
>
> fatal: [man]: UNREACHABLE! => {"changed": false, "msg": "Failed to connect to the host via ssh: Warning: Permanently added '192.168.65.199' (ED25519) to the list of known ***@***.***: Permission denied (publickey).", "unreachable": true}
>
> This issue is caused by a wrong username or ssh key. Since the key is
> generated by CyberRange, more often, the username is an issue. Did you
> override this value -
> https://github.com/cyberrangecz/devops-tf-deployment/blob/master/tf-head-services/tfvars/deployment.tfvars-os-template#L18?
> Are you using a public or private OpenStack cloud provider?
>
> There is also one unrelated issue. Use scenarios from the GitHub -
> https://github.com/orgs/cyberrangecz/repositories?q=library. They are
> updated to work with CRCZP the best.
>
> Kind regards
>
> Tomas
>
> —
> Reply to this email directly, view it on GitHub
> <https://github.com/cyberrangecz/issues/issues/11#issuecomment-3897067093>,
> or unsubscribe
> <https://github.com/notifications/unsubscribe-auth/AYU75P3MSYMTHMYIG7ZZRA34LXCAXAVCNFSM6AAAAACUY4OSLWVHI2DSMVQWIX3LMV43OSLTON2WKQ3PNVWWK3TUHMZTQOJXGA3DOMBZGM>
> .
> You are receiving this because you authored the thread.Message ID:
> ***@***.***>
>

data.openstack_images_image_ids_v2.image_data_source-default-p0000000002-s0000000003-router: Reading...
data.openstack_networking_secgroup_v2.sandbox-internal-sg: Reading...
data.openstack_networking_secgroup_v2.sandbox-access-sg: Reading...
data.openstack_networking_secgroup_v2.sandbox-man-sg: Reading...
data.openstack_images_image_ids_v2.image_data_source-default-p0000000002-s0000000003-man: Reading...
data.openstack_images_image_ids_v2.image_data_source-default-p0000000002-s0000000003-server: Reading...
data.openstack_networking_secgroup_v2.sandbox-man-int-sg: Reading...
data.openstack_images_image_ids_v2.image_data_source-default-p0000000002-s0000000003-client: Reading...
data.openstack_networking_network_v2.base-net: Reading...
data.openstack_images_image_ids_v2.image_data_source-default-p0000000002-s0000000003-client: Read complete after 1s [id=2429479582]
data.openstack_images_image_ids_v2.image_data_source-default-p0000000002-s0000000003-man: Read complete after 1s [id=2429479582]
data.openstack_images_image_ids_v2.image_data_source-default-p0000000002-s0000000003-router: Read complete after 1s [id=1900728400]
data.openstack_networking_secgroup_v2.sandbox-man-sg: Read complete after 1s [id=20f41694-ad38-4d94-9ffa-eda19a934417]
data.openstack_networking_secgroup_v2.sandbox-access-sg: Read complete after 1s [id=df7de828-ef10-473e-9f45-e11ab24df413]
data.openstack_images_image_ids_v2.image_data_source-default-p0000000002-s0000000003-server: Read complete after 1s [id=2429479582]
data.openstack_networking_secgroup_v2.sandbox-internal-sg: Read complete after 1s [id=d0d9571a-ee8f-44bf-ad83-f5a1eed6a400]
data.openstack_networking_network_v2.base-net: Read complete after 1s [id=1113480e-0c6f-4df3-b107-d28aae843d83]
data.openstack_networking_secgroup_v2.sandbox-man-int-sg: Read complete after 1s [id=1045ee42-b816-49d2-8469-72f0d34a3e70]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # openstack_compute_instance_v2.default-p0000000002-s0000000003-client will be created
  + resource "openstack_compute_instance_v2" "default-p0000000002-s0000000003-client" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + config_drive        = true
      + created             = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "standard.small"
      + force_delete        = false
      + hypervisor_hostname = (known after apply)
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = "ubuntu-noble-x86_64"
      + key_pair            = "default-p0000000002-287e7674-ssh"
      + name                = "default-p0000000002-s0000000003-client"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = (known after apply)
      + stop_before_destroy = false
      + updated             = (known after apply)

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + mac            = (known after apply)
          + name           = (known after apply)
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + mac            = (known after apply)
          + name           = (known after apply)
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.default-p0000000002-s0000000003-man will be created
  + resource "openstack_compute_instance_v2" "default-p0000000002-s0000000003-man" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + config_drive        = true
      + created             = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "standard.small"
      + force_delete        = false
      + hypervisor_hostname = (known after apply)
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = "ubuntu-noble-x86_64"
      + key_pair            = "default-p0000000002-287e7674-ssh"
      + name                = "default-p0000000002-s0000000003-man"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = (known after apply)
      + stop_before_destroy = false
      + updated             = (known after apply)

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + mac            = (known after apply)
          + name           = (known after apply)
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + mac            = (known after apply)
          + name           = (known after apply)
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + mac            = (known after apply)
          + name           = (known after apply)
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.default-p0000000002-s0000000003-router will be created
  + resource "openstack_compute_instance_v2" "default-p0000000002-s0000000003-router" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + config_drive        = true
      + created             = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "standard.small"
      + force_delete        = false
      + hypervisor_hostname = (known after apply)
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = "debian-12-x86_64"
      + key_pair            = "default-p0000000002-287e7674-ssh"
      + name                = "default-p0000000002-s0000000003-router"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = (known after apply)
      + stop_before_destroy = false
      + updated             = (known after apply)

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + mac            = (known after apply)
          + name           = (known after apply)
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + mac            = (known after apply)
          + name           = (known after apply)
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + mac            = (known after apply)
          + name           = (known after apply)
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + mac            = (known after apply)
          + name           = (known after apply)
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.default-p0000000002-s0000000003-server will be created
  + resource "openstack_compute_instance_v2" "default-p0000000002-s0000000003-server" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + config_drive        = true
      + created             = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "standard.small"
      + force_delete        = false
      + hypervisor_hostname = (known after apply)
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = "ubuntu-noble-x86_64"
      + key_pair            = "default-p0000000002-287e7674-ssh"
      + name                = "default-p0000000002-s0000000003-server"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = (known after apply)
      + stop_before_destroy = false
      + updated             = (known after apply)

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + mac            = (known after apply)
          + name           = (known after apply)
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + mac            = (known after apply)
          + name           = (known after apply)
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_networking_network_v2.default-p0000000002-s0000000003-client-switch will be created
  + resource "openstack_networking_network_v2" "default-p0000000002-s0000000003-client-switch" {
      + admin_state_up          = true
      + all_tags                = (known after apply)
      + availability_zone_hints = (known after apply)
      + dns_domain              = (known after apply)
      + external                = (known after apply)
      + id                      = (known after apply)
      + mtu                     = (known after apply)
      + name                    = "default-p0000000002-s0000000003-client-switch"
      + port_security_enabled   = (known after apply)
      + qos_policy_id           = (known after apply)
      + region                  = (known after apply)
      + shared                  = (known after apply)
      + tenant_id               = (known after apply)
      + transparent_vlan        = (known after apply)

      + segments (known after apply)
    }

  # openstack_networking_network_v2.default-p0000000002-s0000000003-man-network will be created
  + resource "openstack_networking_network_v2" "default-p0000000002-s0000000003-man-network" {
      + admin_state_up          = true
      + all_tags                = (known after apply)
      + availability_zone_hints = (known after apply)
      + dns_domain              = (known after apply)
      + external                = (known after apply)
      + id                      = (known after apply)
      + mtu                     = (known after apply)
      + name                    = "default-p0000000002-s0000000003-man-network"
      + port_security_enabled   = (known after apply)
      + qos_policy_id           = (known after apply)
      + region                  = (known after apply)
      + shared                  = (known after apply)
      + tenant_id               = (known after apply)
      + transparent_vlan        = (known after apply)

      + segments (known after apply)
    }

  # openstack_networking_network_v2.default-p0000000002-s0000000003-server-switch will be created
  + resource "openstack_networking_network_v2" "default-p0000000002-s0000000003-server-switch" {
      + admin_state_up          = true
      + all_tags                = (known after apply)
      + availability_zone_hints = (known after apply)
      + dns_domain              = (known after apply)
      + external                = (known after apply)
      + id                      = (known after apply)
      + mtu                     = (known after apply)
      + name                    = "default-p0000000002-s0000000003-server-switch"
      + port_security_enabled   = (known after apply)
      + qos_policy_id           = (known after apply)
      + region                  = (known after apply)
      + shared                  = (known after apply)
      + tenant_id               = (known after apply)
      + transparent_vlan        = (known after apply)

      + segments (known after apply)
    }

  # openstack_networking_network_v2.default-p0000000002-s0000000003-wan will be created
  + resource "openstack_networking_network_v2" "default-p0000000002-s0000000003-wan" {
      + admin_state_up          = true
      + all_tags                = (known after apply)
      + availability_zone_hints = (known after apply)
      + dns_domain              = (known after apply)
      + external                = (known after apply)
      + id                      = (known after apply)
      + mtu                     = (known after apply)
      + name                    = "default-p0000000002-s0000000003-wan"
      + port_security_enabled   = (known after apply)
      + qos_policy_id           = (known after apply)
      + region                  = (known after apply)
      + shared                  = (known after apply)
      + tenant_id               = (known after apply)
      + transparent_vlan        = (known after apply)

      + segments (known after apply)
    }

  # openstack_networking_port_v2.default-p0000000002-s0000000003-link-1 will be created
  + resource "openstack_networking_port_v2" "default-p0000000002-s0000000003-link-1" {
      + admin_state_up         = true
      + all_fixed_ips          = (known after apply)
      + all_security_group_ids = (known after apply)
      + all_tags               = (known after apply)
      + device_id              = (known after apply)
      + device_owner           = (known after apply)
      + dns_assignment         = (known after apply)
      + dns_name               = (known after apply)
      + id                     = (known after apply)
      + mac_address            = (known after apply)
      + name                   = "default-p0000000002-s0000000003-link-1"
      + network_id             = (known after apply)
      + port_security_enabled  = (known after apply)
      + qos_policy_id          = (known after apply)
      + region                 = (known after apply)
      + security_group_ids     = [
          + "20f41694-ad38-4d94-9ffa-eda19a934417",
        ]
      + tenant_id              = (known after apply)

      + allowed_address_pairs {
          + ip_address = "192.168.128.0/17"
        }

      + binding (known after apply)

      + fixed_ip {
          + subnet_id = (known after apply)
        }
    }

  # openstack_networking_port_v2.default-p0000000002-s0000000003-link-10 will be created
  + resource "openstack_networking_port_v2" "default-p0000000002-s0000000003-link-10" {
      + admin_state_up         = true
      + all_fixed_ips          = (known after apply)
      + all_security_group_ids = (known after apply)
      + all_tags               = (known after apply)
      + device_id              = (known after apply)
      + device_owner           = (known after apply)
      + dns_assignment         = (known after apply)
      + dns_name               = (known after apply)
      + id                     = (known after apply)
      + mac_address            = (known after apply)
      + name                   = "default-p0000000002-s0000000003-link-10"
      + network_id             = (known after apply)
      + port_security_enabled  = (known after apply)
      + qos_policy_id          = (known after apply)
      + region                 = (known after apply)
      + security_group_ids     = [
          + "d0d9571a-ee8f-44bf-ad83-f5a1eed6a400",
        ]
      + tenant_id              = (known after apply)

      + allowed_address_pairs {
          + ip_address = "0.0.0.0/0"
        }

      + binding (known after apply)

      + fixed_ip {
          + ip_address = "192.168.30.1"
          + subnet_id  = (known after apply)
        }
    }

  # openstack_networking_port_v2.default-p0000000002-s0000000003-link-2 will be created
  + resource "openstack_networking_port_v2" "default-p0000000002-s0000000003-link-2" {
      + admin_state_up         = true
      + all_fixed_ips          = (known after apply)
      + all_security_group_ids = (known after apply)
      + all_tags               = (known after apply)
      + device_id              = (known after apply)
      + device_owner           = (known after apply)
      + dns_assignment         = (known after apply)
      + dns_name               = (known after apply)
      + id                     = (known after apply)
      + mac_address            = (known after apply)
      + name                   = "default-p0000000002-s0000000003-link-2"
      + network_id             = (known after apply)
      + port_security_enabled  = (known after apply)
      + qos_policy_id          = (known after apply)
      + region                 = (known after apply)
      + security_group_ids     = [
          + "d0d9571a-ee8f-44bf-ad83-f5a1eed6a400",
        ]
      + tenant_id              = (known after apply)

      + allowed_address_pairs {
          + ip_address = "0.0.0.0/0"
        }

      + binding (known after apply)

      + fixed_ip {
          + subnet_id = (known after apply)
        }
    }

  # openstack_networking_port_v2.default-p0000000002-s0000000003-link-3 will be created
  + resource "openstack_networking_port_v2" "default-p0000000002-s0000000003-link-3" {
      + admin_state_up         = true
      + all_fixed_ips          = (known after apply)
      + all_security_group_ids = (known after apply)
      + all_tags               = (known after apply)
      + device_id              = (known after apply)
      + device_owner           = (known after apply)
      + dns_assignment         = (known after apply)
      + dns_name               = (known after apply)
      + id                     = (known after apply)
      + mac_address            = (known after apply)
      + name                   = "default-p0000000002-s0000000003-link-3"
      + network_id             = (known after apply)
      + port_security_enabled  = (known after apply)
      + qos_policy_id          = (known after apply)
      + region                 = (known after apply)
      + security_group_ids     = [
          + "1045ee42-b816-49d2-8469-72f0d34a3e70",
        ]
      + tenant_id              = (known after apply)

      + allowed_address_pairs {
          + ip_address = "192.168.128.0/17"
        }

      + binding (known after apply)

      + fixed_ip {
          + subnet_id = (known after apply)
        }
    }

  # openstack_networking_port_v2.default-p0000000002-s0000000003-link-4 will be created
  + resource "openstack_networking_port_v2" "default-p0000000002-s0000000003-link-4" {
      + admin_state_up         = true
      + all_fixed_ips          = (known after apply)
      + all_security_group_ids = (known after apply)
      + all_tags               = (known after apply)
      + device_id              = (known after apply)
      + device_owner           = (known after apply)
      + dns_assignment         = (known after apply)
      + dns_name               = (known after apply)
      + id                     = (known after apply)
      + mac_address            = (known after apply)
      + name                   = "default-p0000000002-s0000000003-link-4"
      + network_id             = (known after apply)
      + port_security_enabled  = (known after apply)
      + qos_policy_id          = (known after apply)
      + region                 = (known after apply)
      + security_group_ids     = [
          + "1045ee42-b816-49d2-8469-72f0d34a3e70",
        ]
      + tenant_id              = (known after apply)

      + allowed_address_pairs {
          + ip_address = "192.168.128.0/17"
        }

      + binding (known after apply)

      + fixed_ip {
          + subnet_id = (known after apply)
        }
    }

  # openstack_networking_port_v2.default-p0000000002-s0000000003-link-5 will be created
  + resource "openstack_networking_port_v2" "default-p0000000002-s0000000003-link-5" {
      + admin_state_up         = true
      + all_fixed_ips          = (known after apply)
      + all_security_group_ids = (known after apply)
      + all_tags               = (known after apply)
      + device_id              = (known after apply)
      + device_owner           = (known after apply)
      + dns_assignment         = (known after apply)
      + dns_name               = (known after apply)
      + id                     = (known after apply)
      + mac_address            = (known after apply)
      + name                   = "default-p0000000002-s0000000003-link-5"
      + network_id             = (known after apply)
      + port_security_enabled  = (known after apply)
      + qos_policy_id          = (known after apply)
      + region                 = (known after apply)
      + security_group_ids     = [
          + "d0d9571a-ee8f-44bf-ad83-f5a1eed6a400",
        ]
      + tenant_id              = (known after apply)

      + allowed_address_pairs {
          + ip_address = "192.168.20.0/24"
        }

      + binding (known after apply)

      + fixed_ip {
          + ip_address = "192.168.20.5"
          + subnet_id  = (known after apply)
        }
    }

  # openstack_networking_port_v2.default-p0000000002-s0000000003-link-6 will be created
  + resource "openstack_networking_port_v2" "default-p0000000002-s0000000003-link-6" {
      + admin_state_up         = true
      + all_fixed_ips          = (known after apply)
      + all_security_group_ids = (known after apply)
      + all_tags               = (known after apply)
      + device_id              = (known after apply)
      + device_owner           = (known after apply)
      + dns_assignment         = (known after apply)
      + dns_name               = (known after apply)
      + id                     = (known after apply)
      + mac_address            = (known after apply)
      + name                   = "default-p0000000002-s0000000003-link-6"
      + network_id             = (known after apply)
      + port_security_enabled  = (known after apply)
      + qos_policy_id          = (known after apply)
      + region                 = (known after apply)
      + security_group_ids     = [
          + "d0d9571a-ee8f-44bf-ad83-f5a1eed6a400",
        ]
      + tenant_id              = (known after apply)

      + allowed_address_pairs {
          + ip_address = "192.168.30.0/24"
        }

      + binding (known after apply)

      + fixed_ip {
          + ip_address = "192.168.30.5"
          + subnet_id  = (known after apply)
        }
    }

  # openstack_networking_port_v2.default-p0000000002-s0000000003-link-7 will be created
  + resource "openstack_networking_port_v2" "default-p0000000002-s0000000003-link-7" {
      + admin_state_up         = true
      + all_fixed_ips          = (known after apply)
      + all_security_group_ids = (known after apply)
      + all_tags               = (known after apply)
      + device_id              = (known after apply)
      + device_owner           = (known after apply)
      + dns_assignment         = (known after apply)
      + dns_name               = (known after apply)
      + id                     = (known after apply)
      + mac_address            = (known after apply)
      + name                   = "default-p0000000002-s0000000003-link-7"
      + network_id             = (known after apply)
      + port_security_enabled  = (known after apply)
      + qos_policy_id          = (known after apply)
      + region                 = (known after apply)
      + security_group_ids     = [
          + "1045ee42-b816-49d2-8469-72f0d34a3e70",
        ]
      + tenant_id              = (known after apply)

      + allowed_address_pairs {
          + ip_address = "192.168.128.0/17"
        }

      + binding (known after apply)

      + fixed_ip {
          + subnet_id = (known after apply)
        }
    }

  # openstack_networking_port_v2.default-p0000000002-s0000000003-link-8 will be created
  + resource "openstack_networking_port_v2" "default-p0000000002-s0000000003-link-8" {
      + admin_state_up         = true
      + all_fixed_ips          = (known after apply)
      + all_security_group_ids = (known after apply)
      + all_tags               = (known after apply)
      + device_id              = (known after apply)
      + device_owner           = (known after apply)
      + dns_assignment         = (known after apply)
      + dns_name               = (known after apply)
      + id                     = (known after apply)
      + mac_address            = (known after apply)
      + name                   = "default-p0000000002-s0000000003-link-8"
      + network_id             = (known after apply)
      + port_security_enabled  = (known after apply)
      + qos_policy_id          = (known after apply)
      + region                 = (known after apply)
      + security_group_ids     = [
          + "d0d9571a-ee8f-44bf-ad83-f5a1eed6a400",
        ]
      + tenant_id              = (known after apply)

      + allowed_address_pairs {
          + ip_address = "0.0.0.0/0"
        }

      + binding (known after apply)

      + fixed_ip {
          + subnet_id = (known after apply)
        }
    }

  # openstack_networking_port_v2.default-p0000000002-s0000000003-link-9 will be created
  + resource "openstack_networking_port_v2" "default-p0000000002-s0000000003-link-9" {
      + admin_state_up         = true
      + all_fixed_ips          = (known after apply)
      + all_security_group_ids = (known after apply)
      + all_tags               = (known after apply)
      + device_id              = (known after apply)
      + device_owner           = (known after apply)
      + dns_assignment         = (known after apply)
      + dns_name               = (known after apply)
      + id                     = (known after apply)
      + mac_address            = (known after apply)
      + name                   = "default-p0000000002-s0000000003-link-9"
      + network_id             = (known after apply)
      + port_security_enabled  = (known after apply)
      + qos_policy_id          = (known after apply)
      + region                 = (known after apply)
      + security_group_ids     = [
          + "d0d9571a-ee8f-44bf-ad83-f5a1eed6a400",
        ]
      + tenant_id              = (known after apply)

      + allowed_address_pairs {
          + ip_address = "0.0.0.0/0"
        }

      + binding (known after apply)

      + fixed_ip {
          + ip_address = "192.168.20.1"
          + subnet_id  = (known after apply)
        }
    }

  # openstack_networking_port_v2.default-p0000000002-s0000000003-man-out-port will be created
  + resource "openstack_networking_port_v2" "default-p0000000002-s0000000003-man-out-port" {
      + admin_state_up         = true
      + all_fixed_ips          = (known after apply)
      + all_security_group_ids = (known after apply)
      + all_tags               = (known after apply)
      + device_id              = (known after apply)
      + device_owner           = (known after apply)
      + dns_assignment         = (known after apply)
      + dns_name               = (known after apply)
      + id                     = (known after apply)
      + mac_address            = (known after apply)
      + name                   = "default-p0000000002-s0000000003-man-out-port"
      + network_id             = "1113480e-0c6f-4df3-b107-d28aae843d83"
      + port_security_enabled  = (known after apply)
      + qos_policy_id          = (known after apply)
      + region                 = (known after apply)
      + security_group_ids     = [
          + "df7de828-ef10-473e-9f45-e11ab24df413",
        ]
      + tenant_id              = (known after apply)

      + allowed_address_pairs {
          + ip_address = "0.0.0.0/0"
        }

      + binding (known after apply)
    }

  # openstack_networking_subnet_v2.default-p0000000002-s0000000003-client-switch-subnet will be created
  + resource "openstack_networking_subnet_v2" "default-p0000000002-s0000000003-client-switch-subnet" {
      + all_tags          = (known after apply)
      + cidr              = "192.168.30.0/24"
      + dns_nameservers   = [
          + "10.10.13.107",
        ]
      + enable_dhcp       = true
      + gateway_ip        = "192.168.30.1"
      + id                = (known after apply)
      + ip_version        = 4
      + ipv6_address_mode = (known after apply)
      + ipv6_ra_mode      = (known after apply)
      + name              = "default-p0000000002-s0000000003-client-switch-subnet"
      + network_id        = (known after apply)
      + no_gateway        = false
      + region            = (known after apply)
      + service_types     = (known after apply)
      + tenant_id         = (known after apply)

      + allocation_pool (known after apply)
    }

  # openstack_networking_subnet_v2.default-p0000000002-s0000000003-man-network-subnet will be created
  + resource "openstack_networking_subnet_v2" "default-p0000000002-s0000000003-man-network-subnet" {
      + all_tags          = (known after apply)
      + cidr              = "192.168.128.0/17"
      + dns_nameservers   = [
          + "10.10.13.107",
        ]
      + enable_dhcp       = true
      + gateway_ip        = (known after apply)
      + id                = (known after apply)
      + ip_version        = 4
      + ipv6_address_mode = (known after apply)
      + ipv6_ra_mode      = (known after apply)
      + name              = "default-p0000000002-s0000000003-man-network-subnet"
      + network_id        = (known after apply)
      + no_gateway        = true
      + region            = (known after apply)
      + service_types     = (known after apply)
      + tenant_id         = (known after apply)

      + allocation_pool (known after apply)
    }

  # openstack_networking_subnet_v2.default-p0000000002-s0000000003-server-switch-subnet will be created
  + resource "openstack_networking_subnet_v2" "default-p0000000002-s0000000003-server-switch-subnet" {
      + all_tags          = (known after apply)
      + cidr              = "192.168.20.0/24"
      + dns_nameservers   = [
          + "10.10.13.107",
        ]
      + enable_dhcp       = true
      + gateway_ip        = "192.168.20.1"
      + id                = (known after apply)
      + ip_version        = 4
      + ipv6_address_mode = (known after apply)
      + ipv6_ra_mode      = (known after apply)
      + name              = "default-p0000000002-s0000000003-server-switch-subnet"
      + network_id        = (known after apply)
      + no_gateway        = false
      + region            = (known after apply)
      + service_types     = (known after apply)
      + tenant_id         = (known after apply)

      + allocation_pool (known after apply)
    }

  # openstack_networking_subnet_v2.default-p0000000002-s0000000003-wan-subnet will be created
  + resource "openstack_networking_subnet_v2" "default-p0000000002-s0000000003-wan-subnet" {
      + all_tags          = (known after apply)
      + cidr              = "100.100.100.0/24"
      + dns_nameservers   = [
          + "10.10.13.107",
        ]
      + enable_dhcp       = true
      + gateway_ip        = (known after apply)
      + id                = (known after apply)
      + ip_version        = 4
      + ipv6_address_mode = (known after apply)
      + ipv6_ra_mode      = (known after apply)
      + name              = "default-p0000000002-s0000000003-wan-subnet"
      + network_id        = (known after apply)
      + no_gateway        = true
      + region            = (known after apply)
      + service_types     = (known after apply)
      + tenant_id         = (known after apply)

      + allocation_pool (known after apply)
    }

Plan: 23 to add, 0 to change, 0 to destroy.
openstack_networking_network_v2.default-p0000000002-s0000000003-wan: Creating...
openstack_networking_network_v2.default-p0000000002-s0000000003-client-switch: Creating...
openstack_networking_network_v2.default-p0000000002-s0000000003-man-network: Creating...
openstack_networking_network_v2.default-p0000000002-s0000000003-server-switch: Creating...
openstack_networking_port_v2.default-p0000000002-s0000000003-man-out-port: Creating...
openstack_networking_network_v2.default-p0000000002-s0000000003-wan: Creation complete after 1s [id=bd4bf9ff-c1be-4477-8e71-885c45b3dd72]
openstack_networking_network_v2.default-p0000000002-s0000000003-man-network: Creation complete after 1s [id=fb7a210e-5b81-4e37-afbe-75b4a305d784]
openstack_networking_subnet_v2.default-p0000000002-s0000000003-wan-subnet: Creating...
openstack_networking_subnet_v2.default-p0000000002-s0000000003-man-network-subnet: Creating...
openstack_networking_network_v2.default-p0000000002-s0000000003-server-switch: Creation complete after 1s [id=9d102009-dd28-41b4-96c4-85f7b4e1f75d]
openstack_networking_subnet_v2.default-p0000000002-s0000000003-server-switch-subnet: Creating...
openstack_networking_port_v2.default-p0000000002-s0000000003-man-out-port: Creation complete after 1s [id=27e795af-c2d3-4dc8-8fce-b5f75bdf531d]
openstack_networking_subnet_v2.default-p0000000002-s0000000003-wan-subnet: Creation complete after 0s [id=2f42ca64-2951-4065-a804-14c0c4c55e3b]
openstack_networking_port_v2.default-p0000000002-s0000000003-link-8: Creating...
openstack_networking_port_v2.default-p0000000002-s0000000003-link-2: Creating...
openstack_networking_subnet_v2.default-p0000000002-s0000000003-man-network-subnet: Creation complete after 0s [id=27e163a5-121b-4e78-9241-61638f7ce1ff]
openstack_networking_subnet_v2.default-p0000000002-s0000000003-server-switch-subnet: Creation complete after 0s [id=a549e776-4b8e-4549-9c5d-e1694c44270d]
openstack_networking_port_v2.default-p0000000002-s0000000003-link-3: Creating...
openstack_networking_port_v2.default-p0000000002-s0000000003-link-9: Creating...
openstack_networking_port_v2.default-p0000000002-s0000000003-link-7: Creating...
openstack_networking_port_v2.default-p0000000002-s0000000003-link-1: Creating...
openstack_networking_port_v2.default-p0000000002-s0000000003-link-4: Creating...
openstack_networking_port_v2.default-p0000000002-s0000000003-link-5: Creating...
openstack_networking_network_v2.default-p0000000002-s0000000003-client-switch: Creation complete after 2s [id=54f41322-d82d-424f-ba73-cb8fac8e63f5]
openstack_networking_subnet_v2.default-p0000000002-s0000000003-client-switch-subnet: Creating...
openstack_networking_port_v2.default-p0000000002-s0000000003-link-8: Creation complete after 1s [id=cef0592f-d5a9-49a6-9113-91e0717ad239]
openstack_networking_port_v2.default-p0000000002-s0000000003-link-2: Creation complete after 1s [id=a84a5596-2bcd-4bd8-b766-8223f26a914d]
openstack_networking_subnet_v2.default-p0000000002-s0000000003-client-switch-subnet: Creation complete after 0s [id=1740308d-e644-492a-aa2c-cf4a86d3d655]
openstack_networking_port_v2.default-p0000000002-s0000000003-link-5: Creation complete after 1s [id=45b4ca14-1940-484b-9afd-61e68d17e23c]
openstack_networking_port_v2.default-p0000000002-s0000000003-link-1: Creation complete after 1s [id=43faff85-8984-4bbd-92e8-47df6362d20b]
openstack_networking_port_v2.default-p0000000002-s0000000003-link-10: Creating...
openstack_networking_port_v2.default-p0000000002-s0000000003-link-9: Creation complete after 1s [id=d589aa6c-6272-4ec9-a1f9-40655994996b]
openstack_networking_port_v2.default-p0000000002-s0000000003-link-6: Creating...
openstack_networking_port_v2.default-p0000000002-s0000000003-link-4: Creation complete after 1s [id=e39e4fd3-ef8e-444c-8c44-aec44195f1cc]
openstack_compute_instance_v2.default-p0000000002-s0000000003-man: Creating...
openstack_networking_port_v2.default-p0000000002-s0000000003-link-3: Creation complete after 1s [id=6b74a949-3a44-4945-8524-0426706d3b48]
openstack_compute_instance_v2.default-p0000000002-s0000000003-server: Creating...
openstack_networking_port_v2.default-p0000000002-s0000000003-link-7: Creation complete after 1s [id=6f241ffc-e517-43c1-907d-dbead6c134d9]
openstack_networking_port_v2.default-p0000000002-s0000000003-link-6: Creation complete after 0s [id=b02ad7e6-fba7-438c-a514-52e05d269cf1]
openstack_compute_instance_v2.default-p0000000002-s0000000003-client: Creating...
openstack_networking_port_v2.default-p0000000002-s0000000003-link-10: Creation complete after 0s [id=795a8a2f-b332-4a5b-8a0c-58c530192332]
openstack_compute_instance_v2.default-p0000000002-s0000000003-router: Creating...
openstack_compute_instance_v2.default-p0000000002-s0000000003-man: Still creating... [10s elapsed]
openstack_compute_instance_v2.default-p0000000002-s0000000003-server: Still creating... [10s elapsed]
openstack_compute_instance_v2.default-p0000000002-s0000000003-client: Still creating... [10s elapsed]
openstack_compute_instance_v2.default-p0000000002-s0000000003-router: Still creating... [10s elapsed]
openstack_compute_instance_v2.default-p0000000002-s0000000003-man: Still creating... [20s elapsed]
openstack_compute_instance_v2.default-p0000000002-s0000000003-server: Still creating... [20s elapsed]
openstack_compute_instance_v2.default-p0000000002-s0000000003-client: Still creating... [20s elapsed]
openstack_compute_instance_v2.default-p0000000002-s0000000003-router: Still creating... [20s elapsed]
openstack_compute_instance_v2.default-p0000000002-s0000000003-server: Creation complete after 22s [id=e6eb7e1c-36fc-46d2-a80e-8117faba2318]
openstack_compute_instance_v2.default-p0000000002-s0000000003-client: Creation complete after 23s [id=f90cb19f-7df6-4fe6-a399-152a659d287a]
openstack_compute_instance_v2.default-p0000000002-s0000000003-man: Creation complete after 24s [id=28444862-94d2-4591-bb4e-3490ad8d6c14]
openstack_compute_instance_v2.default-p0000000002-s0000000003-router: Still creating... [30s elapsed]
openstack_compute_instance_v2.default-p0000000002-s0000000003-router: Creation complete after 35s [id=b7157c1a-f261-48ac-a606-bd41b7106ea9]

Apply complete! Resources: 23 added, 0 changed, 0 destroyed.

Note: switching to 'v1.7.0'.

You are in 'detached HEAD' state. You can look around, make experimental
changes and commit them, and you can discard any commits you make in this
state without impacting any branches by switching back to a branch.

If you want to create a new branch to retain commits you create, you may
do so (now or later) by using -c with the switch command. Example:

  git switch -c <new-branch-name>

Or undo this operation with:

  git switch -

Turn off this advice by setting config variable advice.detachedHead to false

HEAD is now at 85d10a1 Merge pull request #12 from cyberrangecz/feature/custom-syslog-port
[WARNING]: - dependency k3s (v1.0.0) (v1.0.0) from role prometheus differs from
already installed version (v1.1.0), skipping
Starting galaxy role install process
- extracting blackbox-exporter to /app/ansible_repo/provisioning/roles/blackbox-exporter
- blackbox-exporter (v1.0.0) was installed successfully
- dependency k3s already pending installation.
- extracting common to /app/ansible_repo/provisioning/roles/common
- common (v1.0.0) was installed successfully
- extracting docker to /app/ansible_repo/provisioning/roles/docker
- docker (v1.0.0) was installed successfully
- extracting docker-compose to /app/ansible_repo/provisioning/roles/docker-compose
- docker-compose (v1.0.0) was installed successfully
- dependency docker is already installed, skipping.
- extracting interface to /app/ansible_repo/provisioning/roles/interface
- interface (v1.0.2) was installed successfully
- dependency common is already installed, skipping.
- extracting iptables to /app/ansible_repo/provisioning/roles/iptables
- iptables (v1.1.0) was installed successfully
- extracting k3s to /app/ansible_repo/provisioning/roles/k3s
- k3s (v1.1.0) was installed successfully
- extracting man-logging-forward to /app/ansible_repo/provisioning/roles/man-logging-forward
- man-logging-forward (v1.0.0) was installed successfully
- extracting node-exporter to /app/ansible_repo/provisioning/roles/node-exporter
- node-exporter (v1.0.0) was installed successfully
- extracting prometheus to /app/ansible_repo/provisioning/roles/prometheus
- prometheus (v1.0.1) was installed successfully
- extracting user-access to /app/ansible_repo/provisioning/roles/user-access
- user-access (v1.0.0) was installed successfully
- extracting user-access-windows to /app/ansible_repo/provisioning/roles/user-access-windows
- user-access-windows (v1.0.0) was installed successfully
- extracting windows-exporter to /app/ansible_repo/provisioning/roles/windows-exporter
- windows-exporter (v1.0.0) was installed successfully
[WARNING]: Could not match supplied host pattern, ignoring: windows_hosts
ansible-playbook [core 2.16.14]
  config file = /app/ansible_repo/provisioning/ansible.cfg
  configured module search path = ['/root/.ansible/plugins/modules', '/usr/share/ansible/plugins/modules']
  ansible python module location = /usr/local/lib/python3.12/site-packages/ansible
  ansible collection location = /root/.ansible/collections:/usr/share/ansible/collections
  executable location = /usr/local/bin/ansible-playbook
  python version = 3.12.11 (main, Sep  8 2025, 21:45:40) [GCC 12.2.0] (/usr/local/bin/python3.12)
  jinja version = 3.1.6
  libyaml = True
Using /app/ansible_repo/provisioning/ansible.cfg as config file
redirecting (type: modules) ansible.builtin.sysctl to ansible.posix.sysctl
redirecting (type: modules) ansible.builtin.win_command to ansible.windows.win_command
redirecting (type: modules) ansible.builtin.win_file to ansible.windows.win_file
redirecting (type: modules) ansible.builtin.win_copy to ansible.windows.win_copy
redirecting (type: action) ansible.builtin.win_copy to ansible.windows.win_copy
redirecting (type: modules) ansible.builtin.win_user to ansible.windows.win_user
redirecting (type: modules) ansible.builtin.win_user_profile to community.windows.win_user_profile
redirecting (type: modules) ansible.builtin.win_file to ansible.windows.win_file
redirecting (type: modules) ansible.builtin.win_copy to ansible.windows.win_copy
redirecting (type: action) ansible.builtin.win_copy to ansible.windows.win_copy
redirecting (type: modules) ansible.builtin.win_user to ansible.windows.win_user
redirecting (type: modules) ansible.builtin.win_user to ansible.windows.win_user
redirecting (type: modules) ansible.builtin.win_regedit to ansible.windows.win_regedit
redirecting (type: modules) ansible.builtin.win_firewall_rule to community.windows.win_firewall_rule
redirecting (type: modules) ansible.builtin.win_hostname to ansible.windows.win_hostname
redirecting (type: modules) ansible.builtin.win_reboot to ansible.windows.win_reboot
redirecting (type: action) ansible.builtin.win_reboot to ansible.windows.win_reboot
Skipping callback 'default', as we already have a stdout callback.
Skipping callback 'minimal', as we already have a stdout callback.
Skipping callback 'oneline', as we already have a stdout callback.

PLAYBOOK: playbook.yml *********************************************************
21 plays in playbook.yml

PLAY [check the connection with virtual machines through ssh protocol] *********

TASK [ping] ********************************************************************
task path: /app/ansible_repo/provisioning/playbook.yml:11
ok: [router] => {"ansible_facts": {"discovered_interpreter_python": "/usr/bin/python3"}, "attempts": 1, "changed": false, "ping": "pong"}
ok: [man] => {"ansible_facts": {"discovered_interpreter_python": "/usr/bin/python3"}, "attempts": 1, "changed": false, "ping": "pong"}

TASK [Get systemd-resolved status (using command)] *****************************
task path: /app/ansible_repo/provisioning/playbook.yml:17
ok: [router] => {"changed": false, "cmd": ["resolvectl", "status"], "delta": "0:00:00.015118", "end": "2026-02-18 15:12:32.301065", "failed_when_result": false, "msg": "", "rc": 0, "start": "2026-02-18 15:12:32.285947", "stderr": "", "stderr_lines": [], "stdout": "Global\n       Protocols: +LLMNR +mDNS -DNSOverTLS DNSSEC=no/unsupported\nresolv.conf mode: uplink\n\nLink 2 (ens3)\nCurrent Scopes: DNS LLMNR/IPv4 LLMNR/IPv6\n     Protocols: +DefaultRoute +LLMNR -mDNS -DNSOverTLS DNSSEC=no/unsupported\n   DNS Servers: 10.10.13.107\n\nLink 3 (ens4)\nCurrent Scopes: DNS LLMNR/IPv4 LLMNR/IPv6\n     Protocols: +DefaultRoute +LLMNR -mDNS -DNSOverTLS DNSSEC=no/unsupported\n   DNS Servers: 10.10.13.107\n\nLink 4 (ens5)\nCurrent Scopes: DNS LLMNR/IPv4 LLMNR/IPv6\n     Protocols: +DefaultRoute +LLMNR -mDNS -DNSOverTLS DNSSEC=no/unsupported\n   DNS Servers: 10.10.13.107\n\nLink 5 (ens6)\nCurrent Scopes: DNS LLMNR/IPv4 LLMNR/IPv6\n     Protocols: +DefaultRoute +LLMNR -mDNS -DNSOverTLS DNSSEC=no/unsupported\n   DNS Servers: 10.10.13.107", "stdout_lines": ["Global", "       Protocols: +LLMNR +mDNS -DNSOverTLS DNSSEC=no/unsupported", "resolv.conf mode: uplink", "", "Link 2 (ens3)", "Current Scopes: DNS LLMNR/IPv4 LLMNR/IPv6", "     Protocols: +DefaultRoute +LLMNR -mDNS -DNSOverTLS DNSSEC=no/unsupported", "   DNS Servers: 10.10.13.107", "", "Link 3 (ens4)", "Current Scopes: DNS LLMNR/IPv4 LLMNR/IPv6", "     Protocols: +DefaultRoute +LLMNR -mDNS -DNSOverTLS DNSSEC=no/unsupported", "   DNS Servers: 10.10.13.107", "", "Link 4 (ens5)", "Current Scopes: DNS LLMNR/IPv4 LLMNR/IPv6", "     Protocols: +DefaultRoute +LLMNR -mDNS -DNSOverTLS DNSSEC=no/unsupported", "   DNS Servers: 10.10.13.107", "", "Link 5 (ens6)", "Current Scopes: DNS LLMNR/IPv4 LLMNR/IPv6", "     Protocols: +DefaultRoute +LLMNR -mDNS -DNSOverTLS DNSSEC=no/unsupported", "   DNS Servers: 10.10.13.107"]}
ok: [man] => {"changed": false, "cmd": ["resolvectl", "status"], "delta": "0:00:00.014376", "end": "2026-02-18 15:12:31.572856", "failed_when_result": false, "msg": "", "rc": 0, "start": "2026-02-18 15:12:31.558480", "stderr": "", "stderr_lines": [], "stdout": "Global\n         Protocols: -LLMNR -mDNS -DNSOverTLS DNSSEC=no/unsupported\n  resolv.conf mode: stub\n\nLink 2 (ens3)\n    Current Scopes: DNS\n         Protocols: +DefaultRoute -LLMNR -mDNS -DNSOverTLS DNSSEC=no/unsupported\nCurrent DNS Server: 10.10.13.107\n       DNS Servers: 10.10.13.107\n        DNS Domain: openstacklocal\n\nLink 3 (ens4)\n    Current Scopes: DNS\n         Protocols: +DefaultRoute -LLMNR -mDNS -DNSOverTLS DNSSEC=no/unsupported\nCurrent DNS Server: 10.10.13.107\n       DNS Servers: 10.10.13.107\n        DNS Domain: openstacklocal\n\nLink 4 (ens5)\n    Current Scopes: DNS\n         Protocols: +DefaultRoute -LLMNR -mDNS -DNSOverTLS DNSSEC=no/unsupported\nCurrent DNS Server: 10.10.13.107\n       DNS Servers: 10.10.13.107\n        DNS Domain: openstacklocal", "stdout_lines": ["Global", "         Protocols: -LLMNR -mDNS -DNSOverTLS DNSSEC=no/unsupported", "  resolv.conf mode: stub", "", "Link 2 (ens3)", "    Current Scopes: DNS", "         Protocols: +DefaultRoute -LLMNR -mDNS -DNSOverTLS DNSSEC=no/unsupported", "Current DNS Server: 10.10.13.107", "       DNS Servers: 10.10.13.107", "        DNS Domain: openstacklocal", "", "Link 3 (ens4)", "    Current Scopes: DNS", "         Protocols: +DefaultRoute -LLMNR -mDNS -DNSOverTLS DNSSEC=no/unsupported", "Current DNS Server: 10.10.13.107", "       DNS Servers: 10.10.13.107", "        DNS Domain: openstacklocal", "", "Link 4 (ens5)", "    Current Scopes: DNS", "         Protocols: +DefaultRoute -LLMNR -mDNS -DNSOverTLS DNSSEC=no/unsupported", "Current DNS Server: 10.10.13.107", "       DNS Servers: 10.10.13.107", "        DNS Domain: openstacklocal"]}

TASK [Extract DNS Servers (using regex - handles global and per-link)] *********
task path: /app/ansible_repo/provisioning/playbook.yml:24
ok: [router] => {"ansible_facts": {"resolved_upstream_dns": ["10.10.13.107", "10.10.13.107", "10.10.13.107", "10.10.13.107"]}, "changed": false}
ok: [man] => {"ansible_facts": {"resolved_upstream_dns": ["10.10.13.107", "10.10.13.107", "10.10.13.107"]}, "changed": false}

TASK [ping] ********************************************************************
task path: /app/ansible_repo/provisioning/playbook.yml:11
ok: [server] => {"ansible_facts": {"discovered_interpreter_python": "/usr/bin/python3"}, "attempts": 1, "changed": false, "ping": "pong"}
ok: [client] => {"ansible_facts": {"discovered_interpreter_python": "/usr/bin/python3"}, "attempts": 1, "changed": false, "ping": "pong"}

TASK [Get systemd-resolved status (using command)] *****************************
task path: /app/ansible_repo/provisioning/playbook.yml:17
ok: [server] => {"changed": false, "cmd": ["resolvectl", "status"], "delta": "0:00:00.010428", "end": "2026-02-18 15:12:33.085113", "failed_when_result": false, "msg": "", "rc": 0, "start": "2026-02-18 15:12:33.074685", "stderr": "", "stderr_lines": [], "stdout": "Global\n         Protocols: -LLMNR -mDNS -DNSOverTLS DNSSEC=no/unsupported\n  resolv.conf mode: stub\n\nLink 2 (ens3)\n    Current Scopes: DNS\n         Protocols: +DefaultRoute -LLMNR -mDNS -DNSOverTLS DNSSEC=no/unsupported\nCurrent DNS Server: 10.10.13.107\n       DNS Servers: 10.10.13.107\n        DNS Domain: openstacklocal\n\nLink 3 (ens4)\n    Current Scopes: DNS\n         Protocols: +DefaultRoute -LLMNR -mDNS -DNSOverTLS DNSSEC=no/unsupported\nCurrent DNS Server: 10.10.13.107\n       DNS Servers: 10.10.13.107\n        DNS Domain: openstacklocal", "stdout_lines": ["Global", "         Protocols: -LLMNR -mDNS -DNSOverTLS DNSSEC=no/unsupported", "  resolv.conf mode: stub", "", "Link 2 (ens3)", "    Current Scopes: DNS", "         Protocols: +DefaultRoute -LLMNR -mDNS -DNSOverTLS DNSSEC=no/unsupported", "Current DNS Server: 10.10.13.107", "       DNS Servers: 10.10.13.107", "        DNS Domain: openstacklocal", "", "Link 3 (ens4)", "    Current Scopes: DNS", "         Protocols: +DefaultRoute -LLMNR -mDNS -DNSOverTLS DNSSEC=no/unsupported", "Current DNS Server: 10.10.13.107", "       DNS Servers: 10.10.13.107", "        DNS Domain: openstacklocal"]}

TASK [Extract DNS Servers (using regex - handles global and per-link)] *********
task path: /app/ansible_repo/provisioning/playbook.yml:24
ok: [server] => {"ansible_facts": {"resolved_upstream_dns": ["10.10.13.107", "10.10.13.107"]}, "changed": false}

TASK [Get systemd-resolved status (using command)] *****************************
task path: /app/ansible_repo/provisioning/playbook.yml:17
ok: [client] => {"changed": false, "cmd": ["resolvectl", "status"], "delta": "0:00:00.012784", "end": "2026-02-18 15:12:32.941670", "failed_when_result": false, "msg": "", "rc": 0, "start": "2026-02-18 15:12:32.928886", "stderr": "", "stderr_lines": [], "stdout": "Global\n         Protocols: -LLMNR -mDNS -DNSOverTLS DNSSEC=no/unsupported\n  resolv.conf mode: stub\n\nLink 2 (ens3)\n    Current Scopes: DNS\n         Protocols: +DefaultRoute -LLMNR -mDNS -DNSOverTLS DNSSEC=no/unsupported\nCurrent DNS Server: 10.10.13.107\n       DNS Servers: 10.10.13.107\n        DNS Domain: openstacklocal\n\nLink 3 (ens4)\n    Current Scopes: DNS\n         Protocols: +DefaultRoute -LLMNR -mDNS -DNSOverTLS DNSSEC=no/unsupported\nCurrent DNS Server: 10.10.13.107\n       DNS Servers: 10.10.13.107\n        DNS Domain: openstacklocal", "stdout_lines": ["Global", "         Protocols: -LLMNR -mDNS -DNSOverTLS DNSSEC=no/unsupported", "  resolv.conf mode: stub", "", "Link 2 (ens3)", "    Current Scopes: DNS", "         Protocols: +DefaultRoute -LLMNR -mDNS -DNSOverTLS DNSSEC=no/unsupported", "Current DNS Server: 10.10.13.107", "       DNS Servers: 10.10.13.107", "        DNS Domain: openstacklocal", "", "Link 3 (ens4)", "    Current Scopes: DNS", "         Protocols: +DefaultRoute -LLMNR -mDNS -DNSOverTLS DNSSEC=no/unsupported", "Current DNS Server: 10.10.13.107", "       DNS Servers: 10.10.13.107", "        DNS Domain: openstacklocal"]}

TASK [Extract DNS Servers (using regex - handles global and per-link)] *********
task path: /app/ansible_repo/provisioning/playbook.yml:24
ok: [client] => {"ansible_facts": {"resolved_upstream_dns": ["10.10.13.107", "10.10.13.107"]}, "changed": false}

PLAY [Gather facts from proxy-jump] ********************************************

TASK [Gathering Facts] *********************************************************
task path: /app/ansible_repo/provisioning/playbook.yml:29
ok: [proxy-jump]

PLAY [Sandbox networking] ******************************************************

TASK [Gathering Facts] *********************************************************
task path: /app/ansible_repo/provisioning/playbook.yml:32
ok: [router]

TASK [interface : check existence of required variables] ***********************
task path: /app/ansible_repo/provisioning/roles/interface/tasks/main.yml:1
skipping: [router] => (item={'key': 'interface_interfaces', 'value': [{'interface_default_gateway': '100.100.100.54', 'interface_mac': 'fa:16:3e:29:bf:f4', 'interface_routes': [], 'interface_device': 'ens4'}, {'interface_mac': 'fa:16:3e:da:32:71', 'interface_device': 'ens6'}, {'interface_mac': 'fa:16:3e:98:f7:ce', 'interface_device': 'ens5'}, {'interface_mac': 'fa:16:3e:18:32:32', 'interface_device': 'ens3'}]})  => {"ansible_loop_var": "item", "changed": false, "false_condition": "item.value is undefined or not item.value", "item": {"key": "interface_interfaces", "value": [{"interface_default_gateway": "100.100.100.54", "interface_device": "ens4", "interface_mac": "fa:16:3e:29:bf:f4", "interface_routes": []}, {"interface_device": "ens6", "interface_mac": "fa:16:3e:da:32:71"}, {"interface_device": "ens5", "interface_mac": "fa:16:3e:98:f7:ce"}, {"interface_device": "ens3", "interface_mac": "fa:16:3e:18:32:32"}]}, "skip_reason": "Conditional result was False"}
skipping: [router] => {"changed": false, "msg": "All items skipped"}

TASK [Gathering Facts] *********************************************************
task path: /app/ansible_repo/provisioning/playbook.yml:32
ok: [man]

TASK [interface : check existence of required variables] ***********************
task path: /app/ansible_repo/provisioning/roles/interface/tasks/main.yml:7
skipping: [router] => {"changed": false, "false_condition": "(interface_interfaces | rejectattr('interface_mac', 'defined') | length > 0) or\n(interface_interfaces | rejectattr('interface_device', 'defined') | length > 0)\n", "skip_reason": "Conditional result was False"}

TASK [interface : include_tasks] ***********************************************
task path: /app/ansible_repo/provisioning/roles/interface/tasks/main.yml:14

TASK [interface : check existence of required variables] ***********************
task path: /app/ansible_repo/provisioning/roles/interface/tasks/main.yml:1
skipping: [man] => (item={'key': 'interface_interfaces', 'value': [{'interface_default_gateway': '', 'interface_mac': 'fa:16:3e:59:b7:bc', 'interface_routes': [{'gateway': '100.100.100.58', 'mask': '255.255.255.0', 'network': '192.168.20.0'}, {'gateway': '100.100.100.58', 'mask': '255.255.255.0', 'network': '192.168.30.0'}], 'interface_device': 'ens5'}, {'interface_mac': 'fa:16:3e:98:45:73', 'interface_device': 'ens3'}, {'interface_mac': 'fa:16:3e:5a:67:8f', 'interface_device': 'ens4'}]})  => {"ansible_loop_var": "item", "changed": false, "false_condition": "item.value is undefined or not item.value", "item": {"key": "interface_interfaces", "value": [{"interface_default_gateway": "", "interface_device": "ens5", "interface_mac": "fa:16:3e:59:b7:bc", "interface_routes": [{"gateway": "100.100.100.58", "mask": "255.255.255.0", "network": "192.168.20.0"}, {"gateway": "100.100.100.58", "mask": "255.255.255.0", "network": "192.168.30.0"}]}, {"interface_device": "ens3", "interface_mac": "fa:16:3e:98:45:73"}, {"interface_device": "ens4", "interface_mac": "fa:16:3e:5a:67:8f"}]}, "skip_reason": "Conditional result was False"}
included: /app/ansible_repo/provisioning/roles/interface/tasks/Debian.yml for router
skipping: [man] => {"changed": false, "msg": "All items skipped"}

TASK [interface : Determine if Netplan is used] ********************************
task path: /app/ansible_repo/provisioning/roles/interface/tasks/Debian.yml:3
ok: [router] => {"ansible_facts": {"is_netplan": true}, "changed": false}

TASK [interface : check existence of required variables] ***********************
task path: /app/ansible_repo/provisioning/roles/interface/tasks/main.yml:7
skipping: [man] => {"changed": false, "false_condition": "(interface_interfaces | rejectattr('interface_mac', 'defined') | length > 0) or\n(interface_interfaces | rejectattr('interface_device', 'defined') | length > 0)\n", "skip_reason": "Conditional result was False"}

TASK [interface : include_tasks] ***********************************************
task path: /app/ansible_repo/provisioning/roles/interface/tasks/main.yml:14
included: /app/ansible_repo/provisioning/roles/interface/tasks/Debian.yml for man
[DEPRECATION WARNING]: Use 'ansible.utils.ipaddr' module instead. This feature 
will be removed from ansible.netcommon in a release after 2024-01-01. 
Deprecation warnings can be disabled by setting deprecation_warnings=False in 
ansible.cfg.

TASK [interface : Determine if Netplan is used] ********************************
task path: /app/ansible_repo/provisioning/roles/interface/tasks/Debian.yml:3
ok: [man] => {"ansible_facts": {"is_netplan": true}, "changed": false}
Notification for handler Apply Netplan configuration has been saved.

TASK [interface : Generate Netplan configuration] ******************************
task path: /app/ansible_repo/provisioning/roles/interface/tasks/Debian.yml:10
changed: [router] => {"changed": true, "checksum": "460e8948d3e00b8f7f41c30ea6ce3ff314bd82a8", "dest": "/etc/netplan/50-cloud-init.yaml", "gid": 0, "group": "root", "md5sum": "8c0f75f1d6999ee0000389354e423716", "mode": "0644", "owner": "root", "size": 734, "src": "/home/debian/.ansible/tmp/ansible-tmp-1771427558.5407002-351-212382766689534/source", "state": "file", "uid": 0}
Notification for handler Apply Netplan configuration has been saved.

TASK [interface : Generate Netplan configuration] ******************************
task path: /app/ansible_repo/provisioning/roles/interface/tasks/Debian.yml:10
changed: [man] => {"changed": true, "checksum": "cf21784b80ce39527605dd7f98bbc35b594fb5b9", "dest": "/etc/netplan/50-cloud-init.yaml", "gid": 0, "group": "root", "md5sum": "054e07f258d6a18d73601073c0465859", "mode": "0600", "owner": "root", "size": 724, "src": "/home/ubuntu/.ansible/tmp/ansible-tmp-1771427558.7868376-356-259732976125292/source", "state": "file", "uid": 0}

TASK [interface : Apply Netplan configuration] *********************************
task path: /app/ansible_repo/provisioning/roles/interface/tasks/Debian.yml:16
changed: [man] => {"changed": true, "cmd": ["netplan", "apply"], "delta": "0:00:00.885358", "end": "2026-02-18 15:12:41.705610", "msg": "", "rc": 0, "start": "2026-02-18 15:12:40.820252", "stderr": "", "stderr_lines": [], "stdout": "", "stdout_lines": []}

TASK [interface : find all interfaces configuration files] *********************
task path: /app/ansible_repo/provisioning/roles/interface/tasks/Debian.yml:25
skipping: [man] => {"changed": false, "false_condition": "not is_netplan", "skip_reason": "Conditional result was False"}

TASK [interface : Apply Netplan configuration] *********************************
task path: /app/ansible_repo/provisioning/roles/interface/tasks/Debian.yml:16
changed: [router] => {"changed": true, "cmd": ["netplan", "apply"], "delta": "0:00:00.981358", "end": "2026-02-18 15:12:42.488119", "msg": "", "rc": 0, "start": "2026-02-18 15:12:41.506761", "stderr": "\n** (generate:773): WARNING **: 15:12:41.688: Permissions for /etc/netplan/50-cloud-init.yaml are too open. Netplan configuration should NOT be accessible by others.\nCannot call openvswitch: ovsdb-server.service is not running.\n\n** (process:771): WARNING **: 15:12:42.076: Permissions for /etc/netplan/50-cloud-init.yaml are too open. Netplan configuration should NOT be accessible by others.\n\n** (process:771): WARNING **: 15:12:42.210: Permissions for /etc/netplan/50-cloud-init.yaml are too open. Netplan configuration should NOT be accessible by others.\n\n** (process:771): WARNING **: 15:12:42.210: Permissions for /etc/netplan/50-cloud-init.yaml are too open. Netplan configuration should NOT be accessible by others.", "stderr_lines": ["", "** (generate:773): WARNING **: 15:12:41.688: Permissions for /etc/netplan/50-cloud-init.yaml are too open. Netplan configuration should NOT be accessible by others.", "Cannot call openvswitch: ovsdb-server.service is not running.", "", "** (process:771): WARNING **: 15:12:42.076: Permissions for /etc/netplan/50-cloud-init.yaml are too open. Netplan configuration should NOT be accessible by others.", "", "** (process:771): WARNING **: 15:12:42.210: Permissions for /etc/